admbase/src/Documents/ОтражениеСостоянийСотрудников/ОтражениеСостоянийСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтражениеСостоянийСотрудников</name>
  <registerRecords>InformationRegister.СостояниеСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеДанные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/Documents/ОтражениеСостоянийСотрудников/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		 Объект.Дата = НачалоМесяца(Объект.Дата);
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновлениеРегистраЗаданий",,ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = НачалоМесяца(Объект.Дата);
	
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗагрузитьИзмененныеСостояния(Команда)
	
	Если Объект.Проведен Тогда 
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Необходимо отменить проведение";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзмененныеСостоянияНаСервере();
	Объект.Комментарий = "Загружены измененные состояния";
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ЗагрузитьИзмененныеСостоянияНаСервере()
	КонсолидацияЗагрузкаДанных.ПолучитьИзменненыеСостоянияСотрудниковERP(Объект.Дата,Объект.ИсходныеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбора",ЭтотОбъект,Новый Структура);
	
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаПодбора",,ЭтотОбъект,,,,ОписаниеОповещенияОЗакрытии);	
	
	
КонецПроцедуры

// @skip-check module-structure-form-event-regions
// 
// Параметры:
//  РезультатЗакрытия 		- Структура
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура ПослеЗакрытияФормыПодбора(РезультатЗакрытия,ДополнительныеПараметры)  Экспорт 

	Если РезультатЗакрытия = Неопределено Тогда
		 Возврат
	КонецЕсли;
	
	Для каждого ЭлементСписка Из РезультатЗакрытия Цикл
	
		 Если Объект.ИсходныеДанные.НайтиСтроки(Новый Структура("Сотрудник",ЭлементСписка.Значение)).Количество() = 0 Тогда
		 
		 	Объект.ИсходныеДанные.Добавить().Сотрудник = ЭлементСписка.Значение
		 
		 КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ПослеЗакрытияФормыПодбора()

#КонецОбласти
